" --------------------------------------------
" 文字コード関連
" --------------------------------------------
set encoding=utf-8                               " バッファの文字をメモリ上に保存するときに使う文字コードの設定
set fileencodings=iso-2022-jp,euc-jp,sjis,utf-8  " 既存のファイルを開いたときに行われる文字コードの自動判別の設定
                                                 " https://over80.hatenadiary.jp/entry/20080907/1220794834
set fileformat=unix                              " ファイル保存時の改行コードの設定（よくわからん）
set fileformats=unix,dos,mac                     " 既存のファイルを開いたときに行われる改行コードの自動判別の設定（よくわからん）

" --------------------------------------------
" ヴィジュアル
" --------------------------------------------
set number           " 行番号を表示
set hlsearch         " マッチするテキストをすべてハイライトする
syntax on            " シンタックスハイライトを有効にする
colorscheme molokai  " カラースキーマの指定
set showcmd          " ノーマルモードで入力したコマンドを画面右下に表示する
set laststatus=2     " ステータスバーを常に表示

" --------------------------------------------
" 編集操作
" --------------------------------------------
inoremap <silent> jk <ESC>  " jk でインサートモードを抜ける
set ignorecase              " 検索パターンに大文字が含まれているときは大文字と小文字を区別し、
set smartcase               " 小文字のみのときは大文字を小文字を区別しないようにする
set incsearch               " インクリメンタルサーチを有効にする

" --------------------------------------------
" インデント関連
" --------------------------------------------
set expandtab              " Tab キーでスペースを入力する
set tabstop=4              " Tab キーによるインデントの大きさ
set autoindent             " 新しい行を開始したときに、新しい行のインデントを現在の行と同じにする
filetype plugin indent on  " よくわからん
